In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\sukkiiii\anaconda3\new folder\lib\site-packages (9.1.0)
Note: you may need to restart the kernel to use updated packages.

In [48]:

#importing libraries
import pandas as pd
import mysql.connector
import numpy as np

In [49]:
# Reading the CSV files
df_buses_1 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_1.csv")
df_buses_2 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_2.csv")
df_buses_3 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_3.csv")
df_buses_4 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_4.csv")
df_buses_5 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_5.csv")
df_buses_6 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_6.csv")
df_buses_7 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_7.csv")
df_buses_8 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_8.csv")
df_buses_9 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_9.csv")
df_buses_10 = pd.read_csv(r"C:\Users\Sukkiiii\Desktop\CAPSTONE PROJECT\RED BUS\df_buses_10.csv")

# Concatenating all DataFrames into one
Final_df = pd.concat(
    [df_buses_1, df_buses_2, df_buses_3, df_buses_4, df_buses_5, 
     df_buses_6, df_buses_7, df_buses_8, df_buses_9, df_buses_10], 
    ignore_index=True
)

# Optional: Remove duplicates if needed
Final_df.drop_duplicates(inplace=True)

In [50]:
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1882 entries, 0 to 1917
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         1874 non-null   object
 1   Bus_type         1867 non-null   object
 2   Start_time       1874 non-null   object
 3   End_time         1874 non-null   object
 4   Total_duration   1874 non-null   object
 5   Price            1873 non-null   object
 6   Seats_Available  1870 non-null   object
 7   Ratings          1874 non-null   object
 8   Route_link       1882 non-null   object
 9   Route_name       1882 non-null   object
dtypes: object(10)
memory usage: 161.7+ KB

In [51]:
# Ensure the Price column is treated as a string
Final_df["Price"] = Final_df["Price"].astype(str)

# Remove the string "INR" and strip whitespace
Final_df["Price"] = Final_df["Price"].str.replace("INR", "").str.strip()

# Convert the Price column to numeric type
Final_df["Price"] = pd.to_numeric(Final_df["Price"], errors='coerce')

# Fill any NaN values in the Price column with 0
Final_df["Price"] = Final_df["Price"].fillna(0)
print(Final_df["Price"])

0       640.0
1       640.0
2       469.0
3       469.0
4       627.0
        ...
1913    385.0
1914    347.0
1915    288.0
1916    288.0
1917    298.0
Name: Price, Length: 1882, dtype: float64

In [52]:
# Replace "New" with an empty string
Final_df["Ratings"] = Final_df["Ratings"].replace("New", "")

# Strip whitespace
Final_df["Ratings"] = Final_df["Ratings"].str.strip()

# Split the string and take the first element
Final_df["Ratings"] = Final_df["Ratings"].str.split().str[0]

# Convert to numeric, coerce errors to NaN
Final_df["Ratings"] = pd.to_numeric(Final_df["Ratings"], errors="coerce")

# Fill NaN values with 0
Final_df["Ratings"] = Final_df["Ratings"].fillna(0)

# Print the Ratings column
print(Final_df["Ratings"])

0       3.5
1       4.3
2       3.4
3       3.6
4       3.5
       ...
1913    4.3
1914    3.7
1915    3.9
1916    3.6
1917    4.1
Name: Ratings, Length: 1882, dtype: float64

In [53]:
Final_df["Seats_Available"] = Final_df["Seats_Available"].astype(str)

# Remove the string "INR" and strip whitespace
Final_df["Seats_Available"] = Final_df["Seats_Available"].str.replace("Seats available", "").str.strip()

# Convert the Price column to numeric type
Final_df["Seats_Available"] = pd.to_numeric(Final_df["Seats_Available"], errors='coerce')

# Fill any NaN values in the Price column with 0
Final_df["Seats_Available"] = Final_df["Seats_Available"].fillna(0)
print(Final_df["Seats_Available"])

0       30.0
1       24.0
2       17.0
3       12.0
4       21.0
        ...
1913    25.0
1914    32.0
1915    40.0
1916     0.0
1917    18.0
Name: Seats_Available, Length: 1882, dtype: float64

In [54]:
print(Final_df)

                   Bus_name                                   Bus_type  \
0     KSRTC (Kerala) - 1586          Swift Deluxe Non AC Air Bus (2+2)
1     KSRTC (Kerala) - 2133          Swift Deluxe Non AC Air Bus (2+2)
2      KSRTC (Kerala) - 574  Super Express Non AC Seater Air Bus (2+2)
3      KSRTC (Kerala) - 583  Super Express Non AC Seater Air Bus (2+2)
4       KSRTC (Kerala) - 56                SWIFT-GARUDA A/C SEATER BUS
...                     ...                                        ...
1913                  NueGo                  Electric A/C Seater (2+2)
1914       TSB Tour express                            AC Seater (2+2)
1915      City Land Travels                          A/C Sleeper (2+1)
1916      City Land Travels                          A/C Sleeper (2+1)
1917                  NueGo                                        NaN

     Start_time End_time Total_duration  Price  Seats_Available  Ratings  \
0         21:30    06:55        09h 25m  640.0             30.0      3.5
1         22:10    07:35        09h 25m  640.0             24.0      4.3
2         23:00    09:40        10h 40m  469.0             17.0      3.4
3         23:30    09:50        10h 20m  469.0             12.0      3.6
4         23:40    10:00        10h 20m  627.0             21.0      3.5
...         ...      ...            ...    ...              ...      ...
1913      20:35    02:45        06h 10m  385.0             25.0      4.3
1914      22:45    04:05        05h 20m  347.0             32.0      3.7
1915      23:00    04:15        05h 15m  288.0             40.0      3.9
1916      21:00    02:00        05h 00m  288.0              0.0      3.6
1917      21:35    03:30        05h 55m  298.0             18.0      4.1

                                             Route_link  \
0     https://www.redbus.in/bus-tickets/bangalore-to...
1     https://www.redbus.in/bus-tickets/bangalore-to...
2     https://www.redbus.in/bus-tickets/bangalore-to...
3     https://www.redbus.in/bus-tickets/bangalore-to...
4     https://www.redbus.in/bus-tickets/bangalore-to...
...                                                 ...
1913  https://www.redbus.in/bus-tickets/delhi-to-har...
1914  https://www.redbus.in/bus-tickets/delhi-to-har...
1915  https://www.redbus.in/bus-tickets/delhi-to-har...
1916  https://www.redbus.in/bus-tickets/delhi-to-har...
1917  https://www.redbus.in/bus-tickets/delhi-to-har...

                  Route_name
0     Bangalore to Kozhikode
1     Bangalore to Kozhikode
2     Bangalore to Kozhikode
3     Bangalore to Kozhikode
4     Bangalore to Kozhikode
...                      ...
1913       Delhi to Haridwar
1914       Delhi to Haridwar
1915       Delhi to Haridwar
1916       Delhi to Haridwar
1917       Delhi to Haridwar

[1882 rows x 10 columns]

In [55]:
Final_df=Final_df.replace({np.nan: None})
print(Final_df)

                   Bus_name                                   Bus_type  \
0     KSRTC (Kerala) - 1586          Swift Deluxe Non AC Air Bus (2+2)
1     KSRTC (Kerala) - 2133          Swift Deluxe Non AC Air Bus (2+2)
2      KSRTC (Kerala) - 574  Super Express Non AC Seater Air Bus (2+2)
3      KSRTC (Kerala) - 583  Super Express Non AC Seater Air Bus (2+2)
4       KSRTC (Kerala) - 56                SWIFT-GARUDA A/C SEATER BUS
...                     ...                                        ...
1913                  NueGo                  Electric A/C Seater (2+2)
1914       TSB Tour express                            AC Seater (2+2)
1915      City Land Travels                          A/C Sleeper (2+1)
1916      City Land Travels                          A/C Sleeper (2+1)
1917                  NueGo                                       None

     Start_time End_time Total_duration  Price  Seats_Available  Ratings  \
0         21:30    06:55        09h 25m  640.0             30.0      3.5
1         22:10    07:35        09h 25m  640.0             24.0      4.3
2         23:00    09:40        10h 40m  469.0             17.0      3.4
3         23:30    09:50        10h 20m  469.0             12.0      3.6
4         23:40    10:00        10h 20m  627.0             21.0      3.5
...         ...      ...            ...    ...              ...      ...
1913      20:35    02:45        06h 10m  385.0             25.0      4.3
1914      22:45    04:05        05h 20m  347.0             32.0      3.7
1915      23:00    04:15        05h 15m  288.0             40.0      3.9
1916      21:00    02:00        05h 00m  288.0              0.0      3.6
1917      21:35    03:30        05h 55m  298.0             18.0      4.1

                                             Route_link  \
0     https://www.redbus.in/bus-tickets/bangalore-to...
1     https://www.redbus.in/bus-tickets/bangalore-to...
2     https://www.redbus.in/bus-tickets/bangalore-to...
3     https://www.redbus.in/bus-tickets/bangalore-to...
4     https://www.redbus.in/bus-tickets/bangalore-to...
...                                                 ...
1913  https://www.redbus.in/bus-tickets/delhi-to-har...
1914  https://www.redbus.in/bus-tickets/delhi-to-har...
1915  https://www.redbus.in/bus-tickets/delhi-to-har...
1916  https://www.redbus.in/bus-tickets/delhi-to-har...
1917  https://www.redbus.in/bus-tickets/delhi-to-har...

                  Route_name
0     Bangalore to Kozhikode
1     Bangalore to Kozhikode
2     Bangalore to Kozhikode
3     Bangalore to Kozhikode
4     Bangalore to Kozhikode
...                      ...
1913       Delhi to Haridwar
1914       Delhi to Haridwar
1915       Delhi to Haridwar
1916       Delhi to Haridwar
1917       Delhi to Haridwar

[1882 rows x 10 columns]

In [56]:
path="C:/Users/Sukkiiii/Desktop/CAPSTONE PROJECT/RED BUS/df_main.csv"
Final_df.to_csv(path,index=False)

In [57]:
# SQL connection
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Amphi@55",
    database="RED_BUS_DETAILS"
)

my_cursor = conn.cursor()
# Correct syntax to create a database if it doesn't exist
my_cursor.execute("CREATE DATABASE IF NOT EXISTS RED_BUS_DETAILS")

print("Database created or already exists.")

Database created or already exists.

In [59]:
import mysql.connector
import pandas as pd

# Establish database connection
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Amphi@55",
    database="RED_BUS_DETAILS"
)

my_cursor = conn.cursor()

# Create the table
my_cursor.execute('''
CREATE TABLE IF NOT EXISTS bus_details(
    ID INT AUTO_INCREMENT PRIMARY KEY,
    Bus_name VARCHAR(255) NOT NULL,
    Bus_type VARCHAR(255) NOT NULL,
    Start_time DATETIME NOT NULL,
    End_time DATETIME NOT NULL,
    Total_duration TIME NOT NULL,
    Price FLOAT NULL,
    Seats_Available INT NOT NULL,
    Ratings FLOAT NULL,
    Route_link VARCHAR(255) NULL,
    Route_name VARCHAR(255) NULL
)
''')
print("Table Created Successfully")

# Prepare the insert query
insert_query = '''
INSERT INTO bus_details(
    Bus_name,
    Bus_type,
    Start_time,
    End_time,
    Total_duration,
    Price,
    Seats_Available,
    Ratings,
    Route_link,
    Route_name)
VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
'''

# Data Cleaning and Conversion
try:
    # Ensure datetime columns have proper format
    Final_df['Start_time'] = pd.to_datetime(Final_df['Start_time'], format="%Y-%m-%d %H:%M:%S", errors='coerce')
    Final_df['End_time'] = pd.to_datetime(Final_df['End_time'], format="%Y-%m-%d %H:%M:%S", errors='coerce')
    
    # Convert Total_duration to string in 'HH:MM:SS' format for MySQL compatibility
    Final_df['Total_duration'] = pd.to_timedelta(Final_df['Total_duration'], errors='coerce')
    Final_df['Total_duration'] = Final_df['Total_duration'].dt.components.apply(
        lambda row: f"{row.hours:02}:{row.minutes:02}:{row.seconds:02}", axis=1
    )

    # Convert numeric columns to proper types
    Final_df['Price'] = pd.to_numeric(Final_df['Price'], errors='coerce')
    Final_df['Seats_Available'] = pd.to_numeric(Final_df['Seats_Available'], errors='coerce', downcast='integer')
    Final_df['Ratings'] = pd.to_numeric(Final_df['Ratings'], errors='coerce')

    # Fill null values
    Final_df = Final_df.fillna({
        'Price': 0.0,
        'Ratings': 0.0,
        'Route_link': '',
        'Route_name': ''
    })

    # Drop rows with nulls in mandatory fields
    Final_df = Final_df.dropna(subset=['Bus_name', 'Bus_type', 'Start_time', 'End_time', 'Total_duration', 'Seats_Available'])

    # Convert to list of tuples
    data = Final_df.values.tolist()

    # Insert data
    my_cursor.executemany(insert_query, data)
    conn.commit()
    print("Values inserted successfully")
except Exception as e:
    print(f"Error during data processing or insertion: {e}")
finally:
    conn.close()

Table Created Successfully
Values inserted successfully